#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.storage_bucket["bucket_0"].google_storage_bucket.terraform_state will be created
+   resource "google_storage_bucket" "terraform_state" {
+       effective_labels            = {
+           "environment"   = "prod"
+           "managing_tool" = "terraform"
+           "project_name"  = "terraform-state-bucket"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       labels                      = {
+           "environment"   = "prod"
+           "managing_tool" = "terraform"
+           "project_name"  = "terraform-state-bucket"
        }
+       location                    = "EUROPE-SOUTHWEST1"
+       name                        = "terraform-tfstate-prod-bucket"
+       project                     = (known after apply)
+       public_access_prevention    = (known after apply)
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "environment"   = "prod"
+           "managing_tool" = "terraform"
+           "project_name"  = "terraform-state-bucket"
        }
+       uniform_bucket_level_access = (known after apply)
+       url                         = (known after apply)

+       versioning {
+           enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @PRubioDev, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request Main`*